avr-rust/avrd/packs/atmega/ATmega329PA.atdf
        <register caption="Digital Input Disable Register 1" name="DIDR1" offset="0x7F" size="1">
          <bitfield caption="AIN1 Digital Input Disable" mask="0x02" name="AIN1D"/>
          <bitfield caption="AIN0 Digital Input Disable" mask="0x01" name="AIN0D"/>
        </register>
      </register-group>
      <value-group caption="" name="ANALOG_COMP_INTERRUPT">
        <value caption="Interrupt on Toggle" name="VAL_0x00" value="0x00"/>
        <value caption="Reserved" name="VAL_0x01" value="0x01"/>
        <value caption="Interrupt on Falling Edge" name="VAL_0x02" value="0x02"/>
        <value caption="Interrupt on Rising Edge" name="VAL_0x03" value="0x03"/>
      </value-group>
    </module>
    <module caption="JTAG Interface" name="JTAG">
      <register-group caption="JTAG Interface" name="JTAG">
        <register caption="On-Chip Debug Related Register in I/O Memory" name="OCDR" offset="0x51" size="1" mask="0xFF" ocd-rw=""/>
        <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
          <bitfield caption="JTAG Interface Disable" mask="0x80" name="JTD"/>
        </register>
        <register caption="MCU Status Register" name="MCUSR" offset="0x54" size="1" ocd-rw="R">
          <bitfield caption="JTAG Reset Flag" mask="0x10" name="JTRF"/>
        </register>
      </register-group>
    </module>
    <module caption="Liquid Crystal Display" name="LCD">
      <register-group caption="Liquid Crystal Display" name="LCD">
        <register caption="LCD Data Register 18" name="LCDDR18" offset="0xFE" size="1" mask="0x01">
          <bitfield caption="LCD memory bit segment" mask="0x01" name="SEG324"/>
          <bitfield caption="LCD memory bit segment" mask="0x02" name="SEG325"/>
          <bitfield caption="LCD memory bit segment" mask="0x04" name="SEG326"/>
          <bitfield caption="LCD memory bit segment" mask="0x08" name="SEG327"/>
          <bitfield caption="LCD memory bit segment" mask="0x10" name="SEG328"/>
          <bitfield caption="LCD memory bit segment" mask="0x20" name="SEG329"/>
          <bitfield caption="LCD memory bit segment" mask="0x40" name="SEG330"/>
          <bitfield caption="LCD memory bit segment" mask="0x80" name="SEG331"/>
        </register>
        <register caption="LCD Data Register 17" name="LCDDR17" offset="0xFD" size="1" mask="0xFF">
          <bitfield caption="LCD memory bit segment" mask="0x01" name="SEG316"/>
          <bitfield caption="LCD memory bit segment" mask="0x02" name="SEG317"/>
          <bitfield caption="LCD memory bit segment" mask="0x04" name="SEG318"/>
          <bitfield caption="LCD memory bit segment" mask="0x08" name="SEG319"/>
          <bitfield caption="LCD memory bit segment" mask="0x10" name="SEG320"/>
          <bitfield caption="LCD memory bit segment" mask="0x20" name="SEG321"/>
          <bitfield caption="LCD memory bit segment" mask="0x40" name="SEG322"/>
          <bitfield caption="LCD memory bit segment" mask="0x80" name="SEG323"/>
        </register>
        <register caption="LCD Data Register 16" name="LCDDR16" offset="0xFC" size="1" mask="0xFF">
          <bitfield caption="LCD memory bit segment" mask="0x01" name="SEG308"/>
          <bitfield caption="LCD memory bit segment" mask="0x02" name="SEG309"/>
          <bitfield caption="LCD memory bit segment" mask="0x04" name="SEG310"/>
          <bitfield caption="LCD memory bit segment" mask="0x08" name="SEG311"/>
          <bitfield caption="LCD memory bit segment" mask="0x10" name="SEG312"/>
          <bitfield caption="LCD memory bit segment" mask="0x20" name="SEG313"/>
          <bitfield caption="LCD memory bit segment" mask="0x40" name="SEG314"/>
          <bitfield caption="LCD memory bit segment" mask="0x80" name="SEG315"/>
        </register>
        <register caption="LCD Data Register 15" name="LCDDR15" offset="0xFB" size="1" mask="0xFF">
          <bitfield caption="LCD memory bit segment" mask="0x01" name="SEG300"/>
          <bitfield caption="LCD memory bit segment" mask="0x02" name="SEG301"/>
          <bitfield caption="LCD memory bit segment" mask="0x04" name="SEG302"/>
          <bitfield caption="LCD memory bit segment" mask="0x08" name="SEG303"/>
          <bitfield caption="LCD memory bit segment" mask="0x10" name="SEG304"/>
          <bitfield caption="LCD memory bit segment" mask="0x20" name="SEG305"/>
          <bitfield caption="LCD memory bit segment" mask="0x40" name="SEG306"/>
          <bitfield caption="LCD memory bit segment" mask="0x80" name="SEG307"/>
        </register>
        <register caption="LCD Data Register 13" name="LCDDR13" offset="0xF9" size="1" mask="0x01">
          <bitfield caption="LCD memory bit segment" mask="0x01" name="SEG224"/>
          <bitfield caption="LCD memory bit segment" mask="0x02" name="SEG225"/>
          <bitfield caption="LCD memory bit segment" mask="0x04" name="SEG226"/>
          <bitfield caption="LCD memory bit segment" mask="0x08" name="SEG227"/>
          <bitfield caption="LCD memory bit segment" mask="0x10" name="SEG228"/>
          <bitfield caption="LCD memory bit segment" mask="0x20" name="SEG229"/>
          <bitfield caption="LCD memory bit segment" mask="0x40" name="SEG230"/>
          <bitfield caption="LCD memory bit segment" mask="0x80" name="SEG231"/>
        </register>
        <register caption="LCD Data Register 12" name="LCDDR12" offset="0xF8" size="1" mask="0xFF">
          <bitfield caption="LCD memory bit segment" mask="0x01" name="SEG216"/>
          <bitfield caption="LCD memory bit segment" mask="0x02" name="SEG217"/>
          <bitfield caption="LCD memory bit segment" mask="0x04" name="SEG218"/>
          <bitfield caption="LCD memory bit segment" mask="0x08" name="SEG219"/>
          <bitfield caption="LCD memory bit segment" mask="0x10" name="SEG220"/>
          <bitfield caption="LCD memory bit segment" mask="0x20" name="SEG221"/>
          <bitfield caption="LCD memory bit segment" mask="0x40" name="SEG222"/>
          <bitfield caption="LCD memory bit segment" mask="0x80" name="SEG223"/>
        </register>
